In [1]:
import numpy as np
import pandas as pd

# Concat

In [2]:
# https://pandas.pydata.org/docs/user_guide/merging.html

In [3]:
# Simple Stacking
# Concat is not an Intelligent process

In [4]:
a = pd.read_csv('a.csv')
a

    A   B
0  10  20
1  30  40

In [5]:
b = pd.read_csv('b.csv')
b

    A   C
0  10  20
1  30  40

In [6]:
pd.concat([a,b])

    A     B     C
0  10  20.0   NaN
1  30  40.0   NaN
0  10   NaN  20.0
1  30   NaN  40.0

In [7]:
pd.concat([a,b],axis=0) #deafult axis = 0

    A     B     C
0  10  20.0   NaN
1  30  40.0   NaN
0  10   NaN  20.0
1  30   NaN  40.0

In [8]:
# changin the default axis 
data = pd.concat([a,b],axis=1) #  axis = 1

In [9]:
data

    A   B   A   C
0  10  20  10  20
1  30  40  30  40

In [10]:
data.iloc[:,1:3]

    B   A
0  20  10
1  40  30

# Join

In [11]:
pd.concat([a,b],axis=1)

    A   B   A   C
0  10  20  10  20
1  30  40  30  40

In [12]:
# default value of join = outer
pd.concat([a,b],join='outer')

    A     B     C
0  10  20.0   NaN
1  30  40.0   NaN
0  10   NaN  20.0
1  30   NaN  40.0

In [13]:
pd.concat([a,b],join='inner')

    A
0  10
1  30
0  10
1  30

# Merge

In [14]:
# its an intelligent operation
# redundant data will be removed
# no data loss

In [15]:
a

    A   B
0  10  20
1  30  40

In [16]:
b

    A   C
0  10  20
1  30  40

In [17]:
pd.merge(a,b)

    A   B   C
0  10  20  20
1  30  40  40

In [18]:
pd.merge(b,a) #the seq changed

    A   C   B
0  10  20  20
1  30  40  40

In [19]:
a.merge(b) #same as pd.merge(a,b)

    A   B   C
0  10  20  20
1  30  40  40

In [20]:
b.merge(a) #same as pd.merge(b,a)

    A   C   B
0  10  20  20
1  30  40  40

In [21]:
a.merge(b)

    A   B   C
0  10  20  20
1  30  40  40

In [22]:
#  preferred opreation is "MERGING"